[A_StrongholdVillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_StrongholdTownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_StrongholdCityHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_StrongholdCapitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_StrongholdFortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_StrongholdFortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_StrongholdFortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_StrongholdSkyAndEarthTotems H7TownTower]
mName="天地图腾"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_StrongholdMagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_StrongholdMagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_StrongholdMagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_StrongholdMagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_StrongholdHallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_StrongholdHarpyNest H7TownDwelling]
mName="鹰身女妖巢穴"
mDesc="核心生物住所。\n每周可招募20个鹰身女妖。"

[A_StrongholdFuryRoost H7TownDwelling]
mName="怒气栖木"
mDesc="核心生物住所升级。\n可招募并将鹰身女妖升级为鹰身怒妖。\n（基础产量：20/周）"

[A_StrongholdHarpyColony H7TownGrowthEnhancer]
mName="鹰身女妖群落"
mDesc="核心生物住所升级。\n每周鹰身女妖或鹰身怒妖的产量+10。"

[A_StrongholdGnollSlums H7TownDwelling]
mName="豺狼窟"
mDesc="核心生物住所。\n每周可招募24个豺狼人。"

[A_StrongholdGnollHuntingShack H7TownDwelling]
mName="豺狼人猎手棚屋"
mDesc="核心生物住所升级。\n可招募并将豺狼人升级为豺狼人猎手。\n（基础产量：24/周）"

[A_StrongholdGnollFirecamp H7TownGrowthEnhancer]
mName="豺狼人宿营地"
mDesc="核心生物住所升级。\n每周豺狼人或豺狼人猎手的产量+12。"

[A_StrongholdWarTent H7TownDwelling]
mName="战争帐篷"
mDesc="核心生物住所。\n每周可招募12个暴徒。"

[A_StrongholdWarPavilion H7TownDwelling]
mName="战争大帐"
mDesc="核心生物住所升级。\n可招募并将暴徒升级为碎击兵。\n（基础产量：12/周）"

[A_StrongholdOrcBarracks H7TownGrowthEnhancer]
mName="兽人兵营"
mDesc="核心生物住所升级。\n每周暴徒或碎击兵的产量+6。"

[A_StrongholdWyvernRock H7TownDwelling]
mName="双足飞龙之岩"
mDesc="精英生物住所。\n每周可招募7个沙漠飞龙。"

[A_StrongholdWyvernNest H7TownDwelling]
mName="双足飞龙巢穴"
mDesc="精英生物住所升级。\n可招募并将沙漠飞龙升级为毒液飞龙。\n（基础产量：7/周）"

[A_StrongholdWyvernHatchery H7TownGrowthEnhancer]
mName="双足飞龙孵化地"
mDesc="精英生物住所升级。\n每周沙漠飞龙或毒液飞龙的产量+7。"

[A_StrongholdCentaurCamp H7TownDwelling]
mName="半人马营地"
mDesc="精英生物住所。\n每周可招募8个半人马。"

[A_StrongholdCentaurOutpost H7TownDwelling]
mName="半人马哨站"
mDesc="精英生物住所升级。\n可招募并将半人马升级为半人马掠夺者。\n（基础产量：8/周）"

[A_StrongholdCentaurLodge H7TownGrowthEnhancer]
mName="半人马小屋"
mDesc="精英生物住所升级。\n每周半人马或半人马掠夺者的产量+8。"

[A_StrongholdBasiliskCavern H7TownDwelling]
mName="巨蜥洞穴"
mDesc="精英生物住所。\n每周可招募2个巨蜥骑手。"

[A_StrongholdBasiliskNoMansLand H7TownDwelling]
mName="巨蜥禁地"
mDesc="精英生物住所升级。\n可招募并将巨蜥骑手升级为巨蜥枪骑兵。\n（基础产量：2/周）"

[A_StrongholdStonePillars H7TownGrowthEnhancer]
mName="巨岩石柱"
mDesc="精英生物住所升级。\n每周巨蜥骑手或巨蜥枪骑兵的产量+2。"

[A_StrongholdBehemothAbyss H7TownDwelling]
mName="比蒙深渊"
mDesc="冠军生物住所。\n每周可招募2个比蒙。"

[A_StrongholdBehemothRift H7TownDwelling]
mName="比蒙裂谷"
mDesc="冠军生物住所升级。\n可招募并将比蒙升级为远古比蒙。\n（基础产量：2/周）"

[A_StrongholdCyclopsMound H7TownDwelling]
mName="独眼巨人高地"
mDesc="冠军生物住所。\n每周可招募2个独眼巨人。"

[A_StrongholdPillarOfRage H7TownDwelling]
mName="怒气石柱"
mDesc="冠军生物住所升级。\n可招募并将独眼巨人升级为怒眼巨人。\n（基础产量：2/周）"

[A_Strongholdchambre_des_Elite_puissant H7TownDwelling]
mName="咆啸兽洞穴"
mDesc="冠军生物住所。\n可招募咆啸兽。\n可使用"全部招募"功能招募\n（基础产量：1/周）"

[A_Strongholdchambre_des_berseker H7TownDwelling]
mName="野猪牧场"
mDesc="精英生物住所。\n可招募天女。\n可使用"全部招募"功能招募\n（基础产量：4/周）"

[A_StrongholdDeepMine H7TownBuilding]
mName="深邃矿井"
mDesc="每天提供1 %icon_Shadowsteel 影钢。"

[A_StrongholdFatherSkyTotem H7TownBuilding]
mName="天父图腾"
mDesc="在此城镇控制区域内为你的据点英雄+2血怒值。"

[A_StrongholdBloodMagicCrucible H7TownBuilding]
mName="血魔坩埚"
mDesc="在此城镇控制区域内所有敌方英雄-3 %icon_magic 魔力。"

[A_StrongholdDreamLodge H7TownUtilityUnitDwelling]
mName="梦境小屋"
mDesc="战争单位生产。\n提供购买踏梦者的选项。"

[A_StrongholdMoat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断并受到力量伤害。"

[A_StrongholdHouseOfSmalltalks H7TownBuilding]
mName="客套小屋"
mDesc="在此城镇控制区域内为你的英雄与中立军队谈判提供+15%成功率。"

[A_StrongholdHallOfRaiders H7TownBuilding]
mName="劫掠者大厅"
mDesc="每场胜利战斗提供250 %ICON_GOLD 黄金。"

[A_StrongholdIdolOfFertility H7TownIdolOfFertility]
mName="丰产神像"
mDesc="提供选择此城镇中的一个住所的选项，每周一次立即以其实际增长率增长生物以供招募。"

[A_StrongholdMarketPlace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_StrongholdTownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_StrongholdMotherEarthsWisdom H7TownBuilding]
mName="地母智慧"
mDesc="在此城镇控制区域内为你的英雄从胜利战斗中获得+10%经验值。"

[A_StrongholdThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_StrongholdAltarOfBrokenBlades H7TownBuilding]
mName="断刃祭坛"
mDesc="拜访英雄的生物在接下来的3场战斗中受益于+1 %ICON_MAX_MOVEMENT 移动力和+5 %ICON_ATTACK 攻击。"

[A_StrongholdFatherSkysFuror_TearOfAsha H7TownTearOfAsha]
mName="天父之怒"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n为所有你的据点英雄增加2点血怒值。"

[strongholdbuildingabilities.A_StrongholdFatherSkysFuror_HeroBuff H7BaseBuff]
mName="天父之怒"
mTooltip="+2血怒值"

[strongholdbuildingabilities.A_StrongholdHallOfRaiders_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="劫掠者大厅能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdFatherSkysFuror_TownBuff H7BaseBuff]
mName="天父之怒"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdBloodMagicCrucible_Buff H7BaseBuff]
mName="血魔坩埚"
mTooltip="当前控制区域内 %stat %stat.icon 魔力。"

[strongholdbuildingabilities.A_StrongholdFatherSkysFuror_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[strongholdbuildingabilities.A_StrongholdFatherSkyTotem_Buff H7BaseBuff]
mName="天父图腾"
mTooltip="当前控制区域内+2血怒值。"

[strongholdbuildingabilities.A_StrongholdFatherSkyTotem_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天父图腾能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdAltarOfBrokenBlades_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="断刃祭坛能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdBloodMagicCrucible_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="血魔法坩埚能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdHouseOfSmalltalks_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="客套小屋能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdIdolOfFertility_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="丰产神像"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdMotherEarthsWisdom_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地母亲的智慧能力"
mTooltip=""

[strongholdbuildingabilities.A_StrongholdMotherEarthsWisdom_Buff H7BaseBuff]
mName="地母智慧"
mTooltip="当前控制区域内每次战斗胜利后获取的经验值+10%。"

[strongholdbuildingabilities.A_StrongholdHouseOfSmalltalks_Buff H7BaseBuff]
mName="客套小屋"
mTooltip="当前控制区域内对中立生物的外交成功几率增加15%。"

[strongholdbuildingabilities.A_StrongholdAltarOfBrokenBlades_Buff H7BaseBuff]
mName="断刃祭坛"
mTooltip="%stat1 %stat1.icon 移动力和 %stat2 %stat2.icon 攻击直到战斗结束。"

[strongholdbuildingabilities.A_StrongholdAltarOfBrokenBlades_HeroBuff H7BaseBuff]
mName="断刃祭坛"
mTooltip="接下来的 %durini 场战斗中，友方生物获得 %buff1.buff.stat1 %buff1.buff.stat.icon 移动力和 %buff1.buff.stat2 %buff1.buff.stat2.icon 攻击。"

7.5 mod

新增第8单位槽选项

v1.30

新增替代单位 - 雷鸟/大鹏，以及雷鸟/大鹏和飞龙的隐藏能力

v1.37：

修正塔楼描述以说明防守者属性增益
进行了许多修正和调整，使各城堡的描述更加一致和正确

版本 1.30